lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static bool current_demo_result_has_continue(void) {
  return current_demo_step_count() > 3U;
}

static uint16_t current_demo_acl_event_counter(void) {
  return (uint16_t)(0x1200U + (current_channel_selection_group() * 0x10U) +
                    current_step_count_group());
}

static uint16_t current_demo_frequency_compensation(void) {
  return (uint16_t)(0x0010U + ((current_channel_selection_group() & 0x0FU) << 2U) +
                    (current_step_count_group() & 0x03U));
}

static int8_t current_demo_reference_power_dbm(void) {
  int16_t dbm = (int16_t)g_cs_max_tx_power_dbm + (int16_t)g_cs_tx_power_delta;
  if (dbm < -127) {
    dbm = -127;
  }
  if (dbm > 20) {
    dbm = 20;
  }
  return (int8_t)dbm;
}

static uint8_t current_demo_num_antenna_paths(void) {
  uint8_t count = g_cs_tone_antenna_config_selection;
  if (count == 0U) {
    count = 1U;
  }
  if (count > 4U) {
    count = 4U;
  }
  return count;
}

static uint8_t fill_demo_channels_for_procedure(uint8_t *out_channels, uint8_t channel_count) {
  const uint32_t fallback_packed =
      (g_cs_demo_channels_packed != 0U) ? g_cs_demo_channels_packed : g_host_transport->reserved;
  uint8_t enabled[40];
  uint8_t count = 0U;
  uint8_t jump = 1U;
  uint8_t start = 0U;

  if (out_channels == NULL || channel_count == 0U) {
    return 0U;
  }

  for (uint8_t bit = 0U; bit < 40U; ++bit) {
    if (channel_map_bit_enabled(g_cs_channel_map, bit)) {
      enabled[count++] = bit;
    }
  }

  if (count == 0U) {
    for (uint8_t i = 0U; i < channel_count; ++i) {
      const uint8_t shift = (uint8_t)((i & 0x03U) * 8U);
      out_channels[i] = (uint8_t)((fallback_packed >> shift) & 0xFFU);
    }
    return channel_count;
  }

  if (g_cs_channel_selection_type == 1U && g_cs_ch3c_jump > 0U) {
    jump = g_cs_ch3c_jump;
  }
  start = (uint8_t)((current_channel_selection_group() * jump) % count);
  for (uint8_t i = 0U; i < channel_count; ++i) {
    out_channels[i] = enabled[(uint8_t)((start + i) % count)];
  }
  return channel_count;
}

static void update_demo_channels_from_create_config(void) {
  uint8_t channel_map[10];
  uint8_t channels[4];
  uint8_t found = 0U;
  uint8_t last = 2U;
  uint32_t packed = 0U;
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  bytes_copy(channel_map, (const void *)&g_host_transport->hostData[17], sizeof(channel_map));
  for (uint8_t bit = 0U; bit < 80U && found < 4U; ++bit) {
    if (channel_map_bit_enabled(channel_map, bit)) {
      last = bit;
      channels[found++] = bit;
    }
  }
  if (found == 0U) {
    return;
  }
  for (uint8_t i = found; i < 4U; ++i) {
    channels[i] = last;
  }
  for (uint8_t i = 0U; i < 4U; ++i) {
    packed |= ((uint32_t)channels[i] << (8U * i));
  }
  g_cs_demo_channels_packed = packed;
}

static void update_defaults_from_set_default_settings(void) {
  if (g_host_transport->hostLen < 9U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_max_tx_power_dbm = (int8_t)g_host_transport->hostData[8];
}

static void update_create_config_from_command(void) {
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_main_mode_type = g_host_transport->hostData[8];
  g_cs_sub_mode_type = g_host_transport->hostData[9];
  g_cs_min_main_mode_steps = g_host_transport->hostData[10];
  g_cs_max_main_mode_steps = g_host_transport->hostData[11];
  g_cs_main_mode_repetition = g_host_transport->hostData[12];
  g_cs_mode0_steps = g_host_transport->hostData[13];
  g_cs_role = g_host_transport->hostData[14];
  g_cs_rtt_type = g_host_transport->hostData[15];
  g_cs_cs_sync_phy = g_host_transport->hostData[16];
  bytes_copy(g_cs_channel_map, (const void *)&g_host_transport->hostData[17], sizeof(g_cs_channel_map));
  g_cs_channel_map_repetition = g_host_transport->hostData[27];
  g_cs_channel_selection_type = g_host_transport->hostData[28];
  g_cs_ch3c_shape = g_host_transport->hostData[29];
  g_cs_ch3c_jump = g_host_transport->hostData[30];
  g_cs_enhancements1 = g_host_transport->hostData[31];
  g_cs_config_created = 1U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  update_demo_channels_from_create_config();
}

static uint8_t validate_create_config_command(void) {
  if (g_host_transport->hostLen < 32U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }

  const uint8_t config_id = g_host_transport->hostData[6];
  const uint8_t min_steps = g_host_transport->hostData[10];
  const uint8_t max_steps = g_host_transport->hostData[11];
  const uint8_t repetition = g_host_transport->hostData[12];
  const uint8_t mode0_steps = g_host_transport->hostData[13];
  const uint8_t cs_sync_phy = g_host_transport->hostData[16];

  if (config_id == 0U || min_steps == 0U || max_steps < min_steps ||
      repetition == 0U || mode0_steps == 0U || cs_sync_phy == 0U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!channel_map_has_enabled_channels((const uint8_t *)&g_host_transport->hostData[17])) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static void update_procedure_params_from_command(void) {
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    return;
  }
  g_cs_config_id = g_host_transport->hostData[6];
  g_cs_max_procedure_len = read_le16(&g_host_transport->hostData[7]);
  g_cs_min_procedure_interval = read_le16(&g_host_transport->hostData[9]);
  g_cs_max_procedure_interval = read_le16(&g_host_transport->hostData[11]);
  g_cs_max_procedure_count = read_le16(&g_host_transport->hostData[13]);
  g_cs_min_subevent_len = read_le24(&g_host_transport->hostData[15]);
  g_cs_max_subevent_len = read_le24(&g_host_transport->hostData[18]);
  g_cs_tone_antenna_config_selection = g_host_transport->hostData[21];
  g_cs_phy = g_host_transport->hostData[22];
  g_cs_tx_power_delta = (int8_t)g_host_transport->hostData[23];
  g_cs_procedure_params_applied = 1U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_last_peer_gap_ticks = 0U;
}

static void clear_active_cs_state(void) {
  g_cs_config_created = 0U;
  g_cs_security_enabled = 0U;
  g_cs_procedure_params_applied = 0U;
  g_cs_procedure_enabled = 0U;
  g_pending_cs_result_stage = 0U;
  g_cs_procedure_counter = 0U;
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_last_peer_gap_ticks = 0U;
}

static uint8_t validate_remove_config_command(void) {
  if (g_host_transport->hostLen < 7U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_host_transport->hostData[6] != g_cs_config_id) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_security_enable_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_set_procedure_params_command(void) {
  if (g_host_transport->hostLen < 27U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xD1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xD2U : 0xD3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U || g_cs_security_enabled == 0U) {
    g_vpr_transport->lastError =
        (g_cs_config_created == 0U) ? 0xD4U : 0xD5U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_host_transport->hostData[6] != g_cs_config_id) {
    g_vpr_transport->lastError = 0xD6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  {
    const uint16_t max_procedure_len = read_le16(&g_host_transport->hostData[7]);
    const uint16_t min_interval = read_le16(&g_host_transport->hostData[9]);
    const uint16_t max_interval = read_le16(&g_host_transport->hostData[11]);
    const uint16_t max_count = read_le16(&g_host_transport->hostData[13]);
    const uint32_t min_subevent_len = read_le24(&g_host_transport->hostData[15]);
    const uint32_t max_subevent_len = read_le24(&g_host_transport->hostData[18]);
    if (max_procedure_len == 0U || min_interval == 0U || max_interval < min_interval ||
        max_count == 0U || min_subevent_len == 0U ||
        max_subevent_len < min_subevent_len) {
      g_vpr_transport->lastError = 0xD7U;
      return BLE_CS_HCI_STATUS_INVALID_PARAMS;
    }
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

