lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint8_t validate_procedure_enable_command(void) {
  if (g_host_transport->hostLen < 8U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xE1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xE2U : 0xE3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    g_vpr_transport->lastError = 0xE4U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_host_transport->hostData[6] != g_cs_config_id) {
    g_vpr_transport->lastError = 0xE5U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_host_transport->hostData[7] > 1U) {
    g_vpr_transport->lastError = 0xE6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_host_transport->hostData[7] == 0U) {
    g_vpr_transport->lastError = 0U;
    return BLE_CS_HCI_STATUS_SUCCESS;
  }
  if (g_cs_security_enabled == 0U || g_cs_procedure_params_applied == 0U) {
    g_vpr_transport->lastError =
        (g_cs_security_enabled == 0U) ? 0xE7U : 0xE8U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_read_remote_caps_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_cs_session_open == 0U) {
    return BLE_CS_HCI_STATUS_SUCCESS;
  }
  return (read_conn_handle() == g_cs_session_conn_handle) ? BLE_CS_HCI_STATUS_SUCCESS
                                                          : BLE_CS_HCI_STATUS_INVALID_PARAMS;
}

static uint32_t current_procedure_interval_ticks(void) {
  return (g_cs_min_procedure_interval != 0U) ? (uint32_t)g_cs_min_procedure_interval : 1U;
}

static uint32_t current_peer_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 256U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 32U) {
    ticks = 32U;
  }
  return ticks;
}

static bool schedule_next_cs_procedure(void) {
  if (g_cs_procedure_enabled == 0U || g_pending_cs_result_stage != 0U ||
      g_cs_procedure_counter == 0U || g_cs_procedure_counter >= g_cs_max_procedure_count ||
      host_request_pending() ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    return false;
  }
  if (g_vpr_transport->heartbeat < g_cs_next_procedure_heartbeat) {
    return false;
  }
  g_cs_procedure_counter = (uint16_t)(g_cs_procedure_counter + 1U);
  if (g_cs_procedure_counter == 0U) {
    g_cs_procedure_counter = 1U;
  }
  g_pending_cs_result_stage = 1U;
  g_cs_next_procedure_heartbeat = 0U;
  return true;
}
#endif

static size_t build_remote_caps_payload(uint8_t *payload, size_t max_len, uint16_t conn_handle) {
  if (payload == NULL || max_len < 34U) {
    return 0U;
  }
  bytes_zero(payload, 34U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = 4U;
  write_le16(&payload[4], 6U);
  payload[6] = 4U;
  payload[7] = 4U;
  payload[8] = 0x03U;
  payload[9] = 0x01U;
  payload[10] = 0x07U;
  payload[11] = 0x02U;
  payload[12] = 0x03U;
  payload[13] = 0x04U;
  write_le16(&payload[14], 0x0001U);
  write_le16(&payload[16], 0x0001U);
  payload[18] = 0x06U;
  write_le16(&payload[19], 0x001EU);
  write_le16(&payload[21], 10U);
  write_le16(&payload[23], 20U);
  write_le16(&payload[25], 30U);
  write_le16(&payload[27], 40U);
  payload[29] = 3U;
  payload[30] = 4U;
  write_le16(&payload[31], 50U);
  payload[33] = 6U;
  return 34U;
}

static size_t build_security_complete_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 3U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  return 3U;
}

static size_t build_config_complete_payload(uint8_t *payload, size_t max_len,
                                            uint16_t conn_handle) {
  static const uint8_t k_default_channel_map[10] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                                                    0x00U, 0x00U, 0x00U, 0x00U, 0x00U};
  if (payload == NULL || max_len < 33U) {
    return 0U;
  }
  bytes_zero(payload, 33U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[3] = g_cs_config_id;
  payload[5] = g_cs_main_mode_type;
  payload[6] = g_cs_sub_mode_type;
  payload[7] = g_cs_min_main_mode_steps;
  payload[8] = g_cs_max_main_mode_steps;
  payload[9] = g_cs_main_mode_repetition;
  payload[10] = g_cs_mode0_steps;
  payload[11] = g_cs_role;
  payload[12] = g_cs_rtt_type;
  payload[13] = g_cs_cs_sync_phy;
  bytes_copy(&payload[14], g_cs_channel_map, sizeof(g_cs_channel_map));
  payload[24] = g_cs_channel_map_repetition;
  payload[25] = g_cs_channel_selection_type;
  payload[26] = g_cs_ch3c_shape;
  payload[27] = g_cs_ch3c_jump;
  payload[28] = g_cs_enhancements1;
#else
  payload[3] = 1U;
  payload[5] = BLE_CS_MAIN_MODE2;
  payload[6] = 0xFFU;
  payload[7] = 3U;
  payload[8] = 5U;
  payload[9] = 1U;
  payload[10] = 1U;
  payload[11] = 0U;
  payload[12] = 1U;
  payload[13] = 2U;
  bytes_copy(&payload[14], k_default_channel_map, sizeof(k_default_channel_map));
  payload[24] = 1U;
  payload[25] = 1U;
  payload[26] = 1U;
  payload[27] = 3U;
  payload[28] = 0x01U;
#endif
  payload[4] = 1U;
  payload[29] = 10U;
  payload[30] = 20U;
  payload[31] = 30U;
  payload[32] = 40U;
  return 33U;
}

static size_t build_procedure_enable_complete_payload(uint8_t *payload, size_t max_len,
                                                      uint16_t conn_handle) {
  if (payload == NULL || max_len < 21U) {
    return 0U;
  }
  bytes_zero(payload, 21U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[3] = g_cs_config_id;
  payload[5] = g_cs_tone_antenna_config_selection;
  payload[6] = (uint8_t)g_cs_tx_power_delta;
  write_le24(&payload[7], g_cs_min_subevent_len);
  payload[10] = 4U;
  write_le16(&payload[11], g_cs_min_procedure_interval);
  write_le16(&payload[13], g_cs_max_procedure_interval);
  write_le16(&payload[15], g_cs_max_procedure_interval);
  write_le16(&payload[17], g_cs_max_procedure_count);
  write_le16(&payload[19], g_cs_max_procedure_len);
#else
  payload[3] = 1U;
  payload[5] = 2U;
  payload[6] = (uint8_t)(int8_t)-12;
  write_le24(&payload[7], 0x000456UL);
  payload[10] = 4U;
  write_le16(&payload[11], 100U);
  write_le16(&payload[13], 200U);
  write_le16(&payload[15], 300U);
  write_le16(&payload[17], 8U);
  write_le16(&payload[19], 12U);
#endif
  payload[4] =
#if VPR_CS_DEDICATED_IMAGE
      g_cs_procedure_enabled;
#else
      1U;
#endif
  return 21U;
}

static size_t build_subevent_initial_payload(uint8_t *payload, size_t max_len,
                                             uint16_t conn_handle) {
  if (payload == NULL || max_len < 23U) {
    return 0U;
  }
  uint8_t channels[6];
  uint8_t step_count = 4U;
  uint8_t initial_steps = 1U;
  uint8_t has_continue = 1U;
#if VPR_CS_DEDICATED_IMAGE
  step_count = current_demo_step_count();
  if (step_count == 0U) {
    step_count = 1U;
  }
  initial_steps = (uint8_t)((max_len > 15U) ? ((max_len - 15U) / 8U) : 0U);
  if (initial_steps == 0U) {
    return 0U;
  }
  if (initial_steps > step_count) {
    initial_steps = step_count;
  }
  has_continue = (initial_steps < step_count) ? 1U : 0U;
  fill_demo_channels_for_procedure(channels, step_count);
#else
  const uint32_t packed_channels = g_host_transport->reserved;
  channels[0] = (uint8_t)(packed_channels & 0xFFU);
  channels[1] = (uint8_t)((packed_channels >> 8U) & 0xFFU);
  channels[2] = (uint8_t)((packed_channels >> 16U) & 0xFFU);
  channels[3] = (uint8_t)((packed_channels >> 24U) & 0xFFU);
#endif
  bytes_zero(payload, max_len);
  write_le16(&payload[0], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[2] = g_cs_config_id;
  write_le16(&payload[3], current_demo_acl_event_counter());
  write_le16(&payload[7], current_demo_frequency_compensation());
  payload[9] = (uint8_t)current_demo_reference_power_dbm();
  payload[13] = current_demo_num_antenna_paths();
#else
  payload[2] = 1U;
  write_le16(&payload[3], 0x1234U);
  write_le16(&payload[7], 0U);
  payload[9] = 0U;
  payload[13] = 2U;
#endif
#if VPR_CS_DEDICATED_IMAGE
  write_le16(&payload[5], g_cs_procedure_counter);
#else
  write_le16(&payload[5], 7U);
#endif
  payload[10] = has_continue ? 0x01U : 0x00U;
  payload[11] = has_continue ? 0x01U : 0x00U;
  payload[12] = 0U;
  payload[14] = initial_steps;
  size_t offset = 15U;
  for (uint8_t i = 0U; i < initial_steps; ++i) {
    append_mode2_demo_step(&payload[offset], channels[i], i);
    offset += 8U;
  }
  return offset;
}

