lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_subevent_continue_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 16U) {
    return 0U;
  }
  uint8_t channels[6];
  uint8_t step_count = 4U;
  uint8_t initial_steps = 1U;
  uint8_t continue_steps = 0U;
#if VPR_CS_DEDICATED_IMAGE
  step_count = current_demo_step_count();
  if (step_count == 0U) {
    step_count = 1U;
  }
  initial_steps = (uint8_t)((40U > 15U) ? ((40U - 15U) / 8U) : 0U);
  if (initial_steps > step_count) {
    initial_steps = step_count;
  }
  continue_steps = (uint8_t)(step_count - initial_steps);
  if (continue_steps == 0U) {
    return 0U;
  }
  if (continue_steps > (uint8_t)((max_len - 8U) / 8U)) {
    continue_steps = (uint8_t)((max_len - 8U) / 8U);
  }
  if (continue_steps == 0U) {
    return 0U;
  }
  fill_demo_channels_for_procedure(channels, step_count);
#else
  const uint32_t packed_channels = g_host_transport->reserved;
  channels[0] = (uint8_t)(packed_channels & 0xFFU);
  channels[1] = (uint8_t)((packed_channels >> 8U) & 0xFFU);
  channels[2] = (uint8_t)((packed_channels >> 16U) & 0xFFU);
  channels[3] = (uint8_t)((packed_channels >> 24U) & 0xFFU);
#endif
  bytes_zero(payload, max_len);
  write_le16(&payload[0], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[2] = g_cs_config_id;
  payload[6] = current_demo_num_antenna_paths();
#else
  payload[2] = 1U;
  payload[6] = 2U;
#endif
  payload[3] = 0U;
  payload[4] = 0U;
  payload[5] = 0U;
  payload[7] = continue_steps;
  size_t offset = 8U;
  for (uint8_t i = 0U; i < continue_steps; ++i) {
    append_mode2_demo_step(&payload[offset], channels[initial_steps + i],
                           (uint8_t)(initial_steps + i));
    offset += 8U;
  }
  return offset;
}

#if VPR_CS_DEDICATED_IMAGE
static size_t build_peer_subevent_initial_payload(uint8_t *payload, size_t max_len,
                                                  uint16_t conn_handle) {
  if (payload == NULL || max_len < 23U) {
    return 0U;
  }
  uint8_t channels[6];
  uint8_t step_count = current_demo_step_count();
  uint8_t initial_steps = 1U;
  uint8_t has_continue = 1U;
  if (step_count == 0U) {
    step_count = 1U;
  }
  initial_steps = (uint8_t)((max_len > 15U) ? ((max_len - 15U) / 8U) : 0U);
  if (initial_steps == 0U) {
    return 0U;
  }
  if (initial_steps > step_count) {
    initial_steps = step_count;
  }
  has_continue = (initial_steps < step_count) ? 1U : 0U;
  fill_demo_channels_for_procedure(channels, step_count);
  bytes_zero(payload, max_len);
  write_le16(&payload[0], conn_handle);
  payload[2] = g_cs_config_id;
  write_le16(&payload[3], current_demo_acl_event_counter());
  write_le16(&payload[5], g_cs_procedure_counter);
  write_le16(&payload[7], current_demo_frequency_compensation());
  payload[9] = (uint8_t)current_demo_reference_power_dbm();
  payload[10] = has_continue ? 0x01U : 0x00U;
  payload[11] = has_continue ? 0x01U : 0x00U;
  payload[12] = 0U;
  payload[13] = current_demo_num_antenna_paths();
  payload[14] = initial_steps;
  size_t offset = 15U;
  for (uint8_t i = 0U; i < initial_steps; ++i) {
    append_mode2_peer_demo_step(&payload[offset], channels[i], i);
    offset += 8U;
  }
  return offset;
}

static size_t build_peer_subevent_continue_payload(uint8_t *payload, size_t max_len,
                                                   uint16_t conn_handle) {
  if (payload == NULL || max_len < 16U) {
    return 0U;
  }
  uint8_t channels[6];
  uint8_t step_count = current_demo_step_count();
  uint8_t initial_steps = 1U;
  uint8_t continue_steps = 0U;
  if (step_count == 0U) {
    step_count = 1U;
  }
  initial_steps = (uint8_t)((40U > 15U) ? ((40U - 15U) / 8U) : 0U);
  if (initial_steps > step_count) {
    initial_steps = step_count;
  }
  continue_steps = (uint8_t)(step_count - initial_steps);
  if (continue_steps == 0U) {
    return 0U;
  }
  if (continue_steps > (uint8_t)((max_len - 8U) / 8U)) {
    continue_steps = (uint8_t)((max_len - 8U) / 8U);
  }
  if (continue_steps == 0U) {
    return 0U;
  }
  fill_demo_channels_for_procedure(channels, step_count);
  bytes_zero(payload, max_len);
  write_le16(&payload[0], conn_handle);
  payload[2] = g_cs_config_id;
  payload[3] = 0U;
  payload[4] = 0U;
  payload[5] = 0U;
  payload[6] = current_demo_num_antenna_paths();
  payload[7] = continue_steps;
  size_t offset = 8U;
  for (uint8_t i = 0U; i < continue_steps; ++i) {
    append_mode2_peer_demo_step(&payload[offset], channels[initial_steps + i],
                                (uint8_t)(initial_steps + i));
    offset += 8U;
  }
  return offset;
}
#endif

#if !VPR_CS_DEDICATED_IMAGE
static uint16_t read_opcode(void) {
  if (g_host_transport->hostLen < 4U) {
    return 0U;
  }
  if (g_host_transport->hostData[0] != 0x01U) {
    return 0U;
  }
  return (uint16_t)g_host_transport->hostData[1] |
         ((uint16_t)g_host_transport->hostData[2] << 8U);
}

static size_t build_vendor_ping_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t echoedCookie = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen >= 8U) {
    echoedCookie = (uint32_t)g_host_transport->hostData[4] |
                   ((uint32_t)g_host_transport->hostData[5] << 8U) |
                   ((uint32_t)g_host_transport->hostData[6] << 16U) |
                   ((uint32_t)g_host_transport->hostData[7] << 24U);
  }
  payload[0] = 0U;
  write_le32(&payload[1], echoedCookie);
  write_le32(&payload[5], g_vpr_transport->heartbeat);
  return 9U;
}

static size_t build_vendor_info_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 12U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_vpr_transport->status & 0xFFU);
  payload[2] = (uint8_t)(g_vpr_transport->lastError & 0xFFU);
  payload[3] = (uint8_t)(g_vpr_transport->vprFlags & 0xFFU);
  if (g_restored_from_hibernate != 0U) {
    payload[3] = (uint8_t)(payload[3] | VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE);
  }
  write_le32(&payload[4], g_vpr_transport->heartbeat);
  write_le32(&payload[8], g_host_transport->scriptCount);
  return 12U;
}

static size_t build_vendor_capabilities_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 11U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = VPR_VENDOR_SERVICE_VERSION_MAJOR;
  payload[2] = VPR_VENDOR_SERVICE_VERSION_MINOR;
  write_le32(&payload[3],
             VPR_VENDOR_OP_PING |
             VPR_VENDOR_OP_INFO |
             VPR_VENDOR_OP_FNV1A32 |
             VPR_VENDOR_OP_CAPABILITIES |
             VPR_VENDOR_OP_CRC32 |
             VPR_VENDOR_OP_CRC32C |
             VPR_VENDOR_OP_TICKER_CONFIGURE |
             VPR_VENDOR_OP_TICKER_READ_STATE |
             VPR_VENDOR_OP_ENTER_HIBERNATE |
             VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE);
  write_le32(&payload[7], NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U);
  return 11U;
}

static uint32_t fnv1a32_bytes(const uint8_t *data, size_t len) {
  uint32_t hash = 2166136261UL;
  if (data == NULL) {
    return hash;
  }
  for (size_t i = 0U; i < len; ++i) {
    hash ^= (uint32_t)data[i];
    hash *= 16777619UL;
  }
  return hash;
}

static size_t build_vendor_fnv1a_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t hash = 2166136261UL;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    hash = fnv1a32_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], hash);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static uint32_t crc32_bytes(const uint8_t *data, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  if (data == NULL) {
    return crc ^ 0xFFFFFFFFUL;
  }
  for (size_t i = 0U; i < len; ++i) {
    crc ^= (uint32_t)data[i];
    for (uint8_t bit = 0U; bit < 8U; ++bit) {
      const uint32_t mask = -(crc & 1U);
      crc = (crc >> 1U) ^ (0xEDB88320UL & mask);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

static size_t build_vendor_crc32_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t crc = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    crc = crc32_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], crc);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static uint32_t crc32c_bytes(const uint8_t *data, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  if (data == NULL) {
    return crc ^ 0xFFFFFFFFUL;
  }
  for (size_t i = 0U; i < len; ++i) {
    crc ^= (uint32_t)data[i];
    for (uint8_t bit = 0U; bit < 8U; ++bit) {
      const uint32_t mask = -(crc & 1U);
      crc = (crc >> 1U) ^ (0x82F63B78UL & mask);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

static size_t build_vendor_crc32c_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t crc = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    crc = crc32c_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], crc);
  write_le32(&payload[5], processedLen);
  return 9U;
}

