lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void publish_response_for_opcode(uint16_t opcode) {
  const uint32_t count =
      (g_host_transport->scriptCount <= NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT)
          ? g_host_transport->scriptCount
          : NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT;

  g_vpr_transport->lastOpcode = (uint32_t)opcode;
  for (uint32_t i = 0U; i < count; ++i) {
    volatile const Nrf54l15VprTransportScript* script = &g_host_transport->scripts[i];
    if (script->opcode != opcode) {
      continue;
    }

    if (script->responseLen > NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA) {
      g_vpr_transport->lastError = 2U;
      g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_ERROR;
      g_vpr_transport->vprLen = 0U;
      return;
    }

    zero_vpr_data();
    bytes_copy((void *)g_vpr_transport->vprData, (const void *)script->response,
               script->responseLen);
    g_vpr_transport->vprLen = script->responseLen;
    return;
  }

  if (!publish_builtin_response_for_opcode(opcode)) {
    build_unknown_command_response(opcode);
  }
}

static bool publish_pending_cs_result_packet(void) {
  uint8_t payload[40];
  uint8_t packet[96];
  size_t len = 0U;
  uint16_t conn_handle = current_conn_handle();
  if (g_pending_cs_result_stage == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  if (g_pending_cs_result_stage >= 3U &&
      g_vpr_transport->heartbeat < g_cs_next_peer_stage_heartbeat) {
    return false;
  }
  if (g_pending_cs_result_stage == 1U) {
    len = build_subevent_initial_payload(payload, sizeof(payload), conn_handle);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(packet, sizeof(packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT, payload, len);
  } else if (g_pending_cs_result_stage == 2U) {
    len = build_subevent_continue_payload(payload, sizeof(payload), conn_handle);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(packet, sizeof(packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE,
                            payload, len);
  } else if (g_pending_cs_result_stage == 3U) {
#if VPR_CS_DEDICATED_IMAGE
    payload[0] = g_cs_config_id;
    write_le16(&payload[1], g_cs_procedure_counter);
    len = append_h4_vendor_event(packet, sizeof(packet),
                                 VPR_VENDOR_EVENT_CS_PEER_RESULT_SOURCE, payload, 3U);
#else
    payload[0] = 1U;
    len = append_h4_vendor_event(packet, sizeof(packet),
                                 VPR_VENDOR_EVENT_CS_PEER_RESULT_TRIGGER, payload, 1U);
#endif
#if VPR_CS_DEDICATED_IMAGE
  } else if (g_pending_cs_result_stage == 4U) {
    len = build_peer_subevent_initial_payload(payload, sizeof(payload), conn_handle);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(packet, sizeof(packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT, payload, len);
  } else if (g_pending_cs_result_stage == 5U) {
    len = build_peer_subevent_continue_payload(payload, sizeof(payload), conn_handle);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(packet, sizeof(packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE,
                            payload, len);
#endif
  } else {
    return false;
  }
  if (len == 0U) {
    return false;
  }
  zero_vpr_data();
  bytes_copy((void *)g_vpr_transport->vprData, packet, len);
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
#if VPR_CS_DEDICATED_IMAGE
  if (g_pending_cs_result_stage == 1U) {
    if (current_demo_result_has_continue()) {
      g_pending_cs_result_stage = 2U;
    } else {
      const uint32_t peer_gap = current_peer_stage_delay_ticks();
      g_pending_cs_result_stage = 3U;
      g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + peer_gap;
      g_cs_last_peer_gap_ticks = (peer_gap > 7U) ? 7U : (uint8_t)peer_gap;
    }
  } else if (g_pending_cs_result_stage == 2U) {
    const uint32_t peer_gap = current_peer_stage_delay_ticks();
    g_pending_cs_result_stage = 3U;
    g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + peer_gap;
    g_cs_last_peer_gap_ticks = (peer_gap > 7U) ? 7U : (uint8_t)peer_gap;
  } else if (g_pending_cs_result_stage == 3U) {
    g_pending_cs_result_stage = 4U;
    g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + 1U;
  } else if (g_pending_cs_result_stage == 4U) {
    g_pending_cs_result_stage = current_demo_result_has_continue() ? 5U : 0U;
    g_cs_next_peer_stage_heartbeat = 0U;
    if (g_pending_cs_result_stage == 0U) {
      if (g_cs_procedure_enabled != 0U &&
          g_cs_procedure_counter < g_cs_max_procedure_count) {
        g_cs_next_procedure_heartbeat =
            g_vpr_transport->heartbeat + current_procedure_interval_ticks();
      } else {
        g_cs_procedure_enabled = 0U;
        g_cs_next_procedure_heartbeat = 0U;
      }
    }
  } else if (g_pending_cs_result_stage == 5U &&
             g_cs_procedure_enabled != 0U &&
             g_cs_procedure_counter < g_cs_max_procedure_count) {
    g_cs_next_procedure_heartbeat =
        g_vpr_transport->heartbeat + current_procedure_interval_ticks();
    g_cs_next_peer_stage_heartbeat = 0U;
    g_pending_cs_result_stage = 0U;
  } else if (g_pending_cs_result_stage == 5U) {
    g_cs_procedure_enabled = 0U;
    g_cs_next_procedure_heartbeat = 0U;
    g_cs_next_peer_stage_heartbeat = 0U;
    g_pending_cs_result_stage = 0U;
  } else {
    g_cs_next_peer_stage_heartbeat = 0U;
    g_pending_cs_result_stage = 0U;
  }
#else
  g_pending_cs_result_stage =
      (g_pending_cs_result_stage < 3U) ? (uint8_t)(g_pending_cs_result_stage + 1U) : 0U;
#endif
  return true;
}

#if !VPR_CS_DEDICATED_IMAGE
static bool publish_pending_ticker_event(void) {
  uint8_t payload[20];
  size_t len = 0U;
  if (g_ticker_event_queue_count == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  const vpr_ticker_event_entry_t *event = &g_ticker_event_queue[g_ticker_event_queue_head];
  zero_vpr_data();
  len = build_vendor_ticker_event_payload(payload, sizeof(payload), event);
  if (len == 0U) {
    return false;
  }
  len = append_h4_vendor_event((uint8_t *)g_vpr_transport->vprData,
                               NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA,
                               VPR_VENDOR_EVENT_TICKER, payload, len);
  if (len == 0U) {
    return false;
  }
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  bytes_zero(&g_ticker_event_queue[g_ticker_event_queue_head],
             sizeof(g_ticker_event_queue[g_ticker_event_queue_head]));
  g_ticker_event_queue_head = (g_ticker_event_queue_head + 1U) % VPR_TICKER_EVENT_QUEUE_DEPTH;
  g_ticker_event_queue_count = g_ticker_event_queue_count - 1U;
  return true;
}
#endif

